day-02/hpc_case/cavity_with_hole/case/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

inflow_velocity 5; //m/s

internalField   uniform ($inflow_velocity 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($inflow_velocity 0 0);
    }

    outlet
    {
         type            inletOutlet;
         inletValue      $internalField;
         value           $internalField;
    }

    cylinder
    {
        type            noSlip;
    }

    top
    {
        type            symmetry;
    }

    bottom
    {
        type            symmetry;
    }

    front_back
    {
        type            empty;
    }
}

// ************************************************************************* //
