day-02/hpc_case/cavity_with_hole/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.1;

// define vertices coordinates; start with number 0
// use jinja2 python lib to replace var tags with actual values
vertices
(
    (-7.32288 -7.50000 0.00000)	// v0
    (-1.32288 -7.50000 0.00000)	// v1
    (0.00000 -7.50000 0.00000)	// v2
    (1.32288 -7.50000 0.00000)	// v3
    (21.32288 -7.50000 0.00000)	// v4
    (-7.32288 -1.50000 0.00000)	// v5
    (-1.32288 -1.50000 0.00000)	// v6
    (0.00000 -2.00000 0.00000)	// v7
    (1.32288 -1.50000 0.00000)	// v8
    (21.32288 -1.50000 0.00000)	// v9
    (-7.32288 0.00000 0.00000)	// v10
    (-2.00000 0.00000 0.00000)	// v11
    (-1.00000 0.00000 0.00000)	// v12
    (-0.70711 -0.70711 0.00000)	// v13
    (0.00000 -1.00000 0.00000)	// v14
    (0.70711 -0.70711 0.00000)	// v15
    (1.00000 0.00000 0.00000)	// v16
    (0.70711 0.70711 0.00000)	// v17
    (0.00000 1.00000 0.00000)	// v18
    (-0.70711 0.70711 0.00000)	// v19
    (2.00000 0.00000 0.00000)	// v20
    (21.32288 0.00000 0.00000)	// v21
    (-7.32288 1.50000 0.00000)	// v22
    (-1.32288 1.50000 0.00000)	// v23
    (0.00000 2.00000 0.00000)	// v24
    (1.32288 1.50000 0.00000)	// v25
    (21.32288 1.50000 0.00000)	// v26
    (-7.32288 7.50000 0.00000)	// v27
    (-1.32288 7.50000 0.00000)	// v28
    (0.00000 7.50000 0.00000)	// v29
    (1.32288 7.50000 0.00000)	// v30
    (21.32288 7.50000 0.00000)	// v31
    (-7.32288 -7.50000 0.20000)	// v32
    (-1.32288 -7.50000 0.20000)	// v33
    (0.00000 -7.50000 0.20000)	// v34
    (1.32288 -7.50000 0.20000)	// v35
    (21.32288 -7.50000 0.20000)	// v36
    (-7.32288 -1.50000 0.20000)	// v37
    (-1.32288 -1.50000 0.20000)	// v38
    (0.00000 -2.00000 0.20000)	// v39
    (1.32288 -1.50000 0.20000)	// v40
    (21.32288 -1.50000 0.20000)	// v41
    (-7.32288 0.00000 0.20000)	// v42
    (-2.00000 0.00000 0.20000)	// v43
    (-1.00000 0.00000 0.20000)	// v44
    (-0.70711 -0.70711 0.20000)	// v45
    (0.00000 -1.00000 0.20000)	// v46
    (0.70711 -0.70711 0.20000)	// v47
    (1.00000 0.00000 0.20000)	// v48
    (0.70711 0.70711 0.20000)	// v49
    (0.00000 1.00000 0.20000)	// v50
    (-0.70711 0.70711 0.20000)	// v51
    (2.00000 0.00000 0.20000)	// v52
    (21.32288 0.00000 0.20000)	// v53
    (-7.32288 1.50000 0.20000)	// v54
    (-1.32288 1.50000 0.20000)	// v55
    (0.00000 2.00000 0.20000)	// v56
    (1.32288 1.50000 0.20000)	// v57
    (21.32288 1.50000 0.20000)	// v58
    (-7.32288 7.50000 0.20000)	// v59
    (-1.32288 7.50000 0.20000)	// v60
    (0.00000 7.50000 0.20000)	// v61
    (1.32288 7.50000 0.20000)	// v62
    (21.32288 7.50000 0.20000)	// v63
);

// Edges of foil boundary only, replace with spline
//	spline A B
//      ( 
//        (x1 y1 z1) - interpolacijske točke
//        (x2 y2 z2)
//        ...
//        (xn yn zn)
//     )
edges
(
    // inner circle
    arc 12 13 45 (0 0 1) // 45 degrees, z-normal
    arc 13 14 45 (0 0 1) // 45 degrees, z-normal
    arc 14 15 45 (0 0 1) // 45 degrees, z-normal
    arc 15 16 45 (0 0 1) // 45 degrees, z-normal
    arc 16 17 45 (0 0 1) // 45 degrees, z-normal
    arc 17 18 45 (0 0 1) // 45 degrees, z-normal
    arc 18 19 45 (0 0 1) // 45 degrees, z-normal
    arc 19 12 45 (0 0 1) // 45 degrees, z-normal
    arc 44 45 45 (0 0 1) // 45 degrees, z-normal
    arc 45 46 45 (0 0 1) // 45 degrees, z-normal
    arc 46 47 45 (0 0 1) // 45 degrees, z-normal
    arc 47 48 45 (0 0 1) // 45 degrees, z-normal
    arc 48 49 45 (0 0 1) // 45 degrees, z-normal
    arc 49 50 45 (0 0 1) // 45 degrees, z-normal
    arc 50 51 45 (0 0 1) // 45 degrees, z-normal
    arc 51 44 45 (0 0 1) // 45 degrees, z-normal

    // outer circle
    arc 11  6 45 (0 0 1) // 45 degrees, z-normal
    arc  6  7 45 (0 0 1) // 45 degrees, z-normal
    arc  7  8 45 (0 0 1) // 45 degrees, z-normal
    arc  8 20 45 (0 0 1) // 45 degrees, z-normal
    arc 20 25 45 (0 0 1) // 45 degrees, z-normal
    arc 25 24 45 (0 0 1) // 45 degrees, z-normal
    arc 24 23 45 (0 0 1) // 45 degrees, z-normal
    arc 23 11 45 (0 0 1) // 45 degrees, z-normal
    arc 43 38 45 (0 0 1) // 45 degrees, z-normal
    arc 38 39 45 (0 0 1) // 45 degrees, z-normal
    arc 39 40 45 (0 0 1) // 45 degrees, z-normal
    arc 40 52 45 (0 0 1) // 45 degrees, z-normal
    arc 52 57 45 (0 0 1) // 45 degrees, z-normal
    arc 57 56 45 (0 0 1) // 45 degrees, z-normal
    arc 56 55 45 (0 0 1) // 45 degrees, z-normal
    arc 55 43 45 (0 0 1) // 45 degrees, z-normal
);

// define mesh blocks
blocks
(
    hex ( 6  5  0  1 38 37 32 33) (10 10 1) simpleGrading (4.00 4.00 1) // cell #  0
    hex (39 34 33 38  7  2  1  6) (10 5 1) simpleGrading (4.00 1.00 1) // cell #  1
    hex ( 7  2  3  8 39 34 35 40) (10 5 1) simpleGrading (4.00 1.00 1) // cell #  2
    hex (40 41 36 35  8  9  4  3) (30 10 1) simpleGrading (4.00 4.00 1) // cell #  3 - flip z
    hex (11 10  5  6 43 42 37 38) (10 5 1) simpleGrading (4.00 1.00 1) // cell #  4
    hex (12 11  6 13 44 43 38 45) (5 5 1) simpleGrading (1.20 1.00 1) // cell #  5i
    hex (46 39 38 45 14  7  6 13) (5 5 1) simpleGrading (1.20 1.00 1) // cell #  6i
    hex (14  7  8 15 46 39 40 47) (5 5 1) simpleGrading (1.20 1.00 1) // cell #  7i
    hex (48 52 40 47 16 20  8 15) (5 5 1) simpleGrading (1.20 1.00 1) // cell #  8i - flip z
    hex (52 53 41 40 20 21  9  8) (30 5 1) simpleGrading (4.00 1.00 1) // cell # 9 - flip z
    hex (43 42 54 55 11 10 22 23) (10 5 1) simpleGrading (4.00 1.00 1) // cell # 10  - flip z
    hex (44 43 55 51 12 11 23 19) (5 5 1) simpleGrading (1.20 1.00 1) // cell # 11i - flip z
    hex (18 24 23 19 50 56 55 51) (5 5 1) simpleGrading (1.20 1.00 1) // cell # 12i
    hex (50 56 57 49 18 24 25 17) (5 5 1) simpleGrading (1.20 1.00 1) // cell # 13i
    hex (16 20 25 17 48 52 57 49) (5 5 1) simpleGrading (1.20 1.00 1) // cell # 14i
    hex (20 21 26 25 52 53 58 57) (30 5 1) simpleGrading (4.00 1.00 1) // cell # 15
    hex (55 54 59 60 23 22 27 28) (10 10 1) simpleGrading (4.00 4.00 1) // cell # 16 - flip z
    hex (24 29 28 23 56 61 60 55) (10 5 1) simpleGrading (4.00 1.00 1) // cell # 17
    hex (56 61 62 57 24 29 30 25) (10 5 1) simpleGrading (4.00 1.00 1) // cell # 18
    hex (25 26 31 30 57 58 63 62) (30 10 1) simpleGrading (4.00 4.00 1) // cell # 19 - flip z
);

defaultPatch
{
    name front_back;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 5  0 32 37)
            (10  5 37 42)
            (22 10 42 54)
            (27 22 54 59)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 4  9 41 36)
            ( 9 21 53 41)
            (21 26 58 53)
            (26 31 63 58)
        );
    }

    top
    {
        type symmetry;
        faces
        (
            (28 27 59 60)
            (29 28 60 61)
            (30 29 61 62)
            (31 30 62 63)
        );
    }

    bottom
    {
        type symmetry;
        faces
        (
            (0 1 33 32)
            (1 2 34 33)
            (2 3 35 34)
            (3 4 36 35)
        );
    }

    cylinder
    {
        type wall;
        faces
        (
            (12 19 51 44)
            (19 18 50 51)
            (18 17 49 50)
            (17 16 48 49)
            (13 12 44 45)
            (14 13 45 46)
            (15 14 46 47)
            (16 15 47 48)
        );
    }
);